Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Setting up a project and further integration with Renesas' ecosystem is described in detail on :ref:`page Renesas <renesas>`.
it_it: La configurazione di un progetto e l'ulteriore integrazione con l'ecosistema Renesas sono descritte in dettaglio nella :ref:`pagina Renesas <renesas>`.

source: Setup
it_it: Configurazione

source: Setup OpenGL ES Driver
it_it: Configurazione del Driver OpenGL ES

source: Several different versions of ``matchbox-desktop`` might exist.
it_it: Potrebbero esistere diverse versioni di ``matchbox-desktop``.

source: Several drawing features in LVGL can be offloaded to the G2D engine.
it_it: Diverse funzionalità di disegno in LVGL possono essere demandate al motore G2D.

source: Several drawing features in LVGL can be offloaded to the PXP engine.
it_it: Diverse funzionalità di disegno in LVGL possono essere demandate al motore PXP.

source: Several drawing features in LVGL can be offloaded to the VGLite engine.
it_it: Diverse funzionalità di disegno in LVGL possono essere scaricate sul motore VGLite.

source: Shadow color.
it_it: Colore dell'ombra.

source: Shadow styles
it_it: Stili per le Ombre

source: Shadow width (blur radius).
it_it: Ampiezza dell'ombra (raggio di sfocatura).

source: Share LVGL-based projects with XML files as part of a commercial product or firmware.
it_it: Condividere progetti basati su LVGL con file XML come parte di un prodotto commerciale o di un firmware.

source: Share XML-based UI files within customer firmware or projects that target LVGL-based embedded systems.
it_it: Condividere file di interfaccia utente basati su XML all'interno del firmware del cliente o di progetti destinati a sistemi embedded basati su LVGL.

source: Share or publish internal tooling built around this Specification.
it_it: Condividere o pubblicare strumenti interni basati su questa Specifica.

source: Sharing Environments
it_it: Condivisione degli Ambienti

source: Shift+click and keyboard-only text selection with Shift+Arrow keys is expected to be added in the future.
it_it: In futuro si prevede di aggiungere la selezione del testo tramite Shift+Click e la selezione del testo tramite tastiera con Shift+Freccia.

source: Short "code summaries" of a few lines are accepted: ``/* Calculate new coordinates */``
it_it: Sono accettati brevi "riassunti" di poche righe: ``/* Calculate new coordinates */``

source: Shortening the cycle of changing and fine-tuning a GUI
it_it: Ridurre il ciclo di modifica e messa a punto di una GUI

source: Shortening the cycle of changing and fine-tuning the GUI.
it_it: Abbreviare il ciclo di modifica e messa a punto dell'interfaccia utente grafica.

source: Should be LV_GRID_TEMPLATE_LAST terminated
it_it: Dovrebbe essere terminato con LV_GRID_TEMPLATE_LAST

source: Should be a pointer to `lv_anim_t`.
it_it: Dovrebbe essere un puntatore a `lv_anim_t`.

source: Show LTR, RTL and Chinese texts
it_it: Visualizzazione di testi LTR, RTL e in cinese

source: Show Obj's Style
it_it: Mostrare lo Stile di Obj

source: Show cursor on the clicked point
it_it: Mostrare il cursore sul punto cliccato

source: Show selected
it_it: Mostrare il selezionato

source: Show the value of the pressed points
it_it: Mostrare il valore dei punti premuti

source: Showing empathy towards other community members
it_it: Mostrare empatia verso gli altri membri della comunità

source: Sidebar Page: :cpp:type:`lv_menu_page`
it_it: Pagina Barra Laterale: :cpp:type:`lv_menu_page`

source: Sidebar container: :cpp:type:`lv_menu_sidebar_cont`
it_it: Contenitore barra laterale: :cpp:type:`lv_menu_sidebar_cont`

source: Sidebar header: :cpp:type:`lv_menu_sidebar_header_cont`
it_it: Intestazione barra laterale: :cpp:type:`lv_menu_sidebar_header_cont`

source: Significant RAM can be saved by using a smaller color format.
it_it: È possibile risparmiare una quantità significativa di RAM utilizzando un formato colore più piccolo.

source: Significant stuttering occurs during profiling
it_it: Si verificano notevoli interruzioni durante la profilazione

source: Similar mechanism for **LittleFS** uses the ``flash_data`` folder, but it's only available for Linux hosts
it_it: Un meccanismo simile per **LittleFS** usa la cartella ``flash_data``, ma è disponibile solo per host Linux.

source: Similar to Button Matrix, the Keyboard Widget consists of 2 parts:
it_it: Simile alla Button Matrix, il Widget Keyboard è composto da 2 parti:

source: Similar to context-sensitive assistance available in other "smart editors", the Editor Pane assists you with almost every keystroke, considerably shortening the learning curve required to produce finished, professional-quality UIs with |lvglpro|.
it_it: Simile all'assistenza contestuale disponibile in altri "editor intelligenti", il riquadro dell'editor assiste l'utente praticamente in ogni battitura, riducendo notevolmente la curva di apprendimento necessaria per produrre interfacce utente complete e di qualità professionale con |lvglpro|.

source: Similar to many other parts of LVGL, the concept of setting coordinates is inspired by CSS.
it_it: Similmente a molte altre parti di LVGL, il concetto di impostazione delle coordinate è ispirato ai CSS.

source: Similar to the Top- and System Layers, the Bottom Layer is also the full size of the Display, but it is located below the :ref:`active_screen`.
it_it: Similmente ai Layer Superiore e di Sistema, anche il Layer Inferiore ha le stesse dimensioni del Display, ma si trova sotto :ref:`active_screen`.

source: Similarly :cpp:expr:`lv_arc_rotate_obj_to_angle(arc, widget_to_rotate, radius_offset)` can be used to rotate the Widget to the current value of the Arc.
it_it: Analogamente, :cpp:expr:`lv_arc_rotate_obj_to_angle(arc, widget_to_rotate, radius_offset)` può essere utilizzato per ruotare il Widget in base al valore corrente dell'Arco.

source: Similarly for the demos ``lvgl/demos`` to ``lvgl/src/demos``.
it_it: Analogamente, per le demo ``lvgl/demos`` in ``lvgl/src/demos``.

source: Similarly, if a :ref:`Slider <lv_slider>` has focus and you press the left or right arrows, the slider's value will be changed.
it_it: Analogamente, se uno :ref:`Slider <lv_slider>` ha il focus e si premono le frecce sinistra o destra, il valore del cursore verrà modificato.

source: Similarly, if opacity is not supported (e.g. :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`), it will be ignored.
it_it: Allo stesso modo, se l'opacità non è supportata (ad esempio :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`), verrà ignorata.

source: Similarly, the policies can be applied if the height of the text is greater than the height of the Label.
it_it: Analogamente, le policy possono essere applicate se l'altezza del testo è maggiore dell'altezza della Label.

source: Similarly, translations can be registered by :cpp:expr:`lv_xml_register_translation_from_data()` and :cpp:expr:`lv_xml_register_translation_from_file()`.
it_it: Allo stesso modo, le traduzioni possono essere registrate tramite :cpp:expr:`lv_xml_register_translation_from_data()` e :cpp:expr:`lv_xml_register_translation_from_file()`.

source: Simple Animation Image
it_it: Immagine animata semplice

source: Simple Arc
it_it: Arco semplice

source: Simple Arc Label
it_it: Semplice Arc Label

source: Simple Bar
it_it: Barra semplice

source: Simple Button matrix
it_it: Matrice di pulsanti semplice

source: Simple Buttons
it_it: Pulsanti semplici

source: Simple Checkboxes
it_it: Checkbox Semplici

source: Simple Drop down list
it_it: Menù a discesa semplice

source: Simple Example
it_it: Semplice Esempio

source: Simple File Explorer
it_it: File Explorer Semplice

source: Simple Gestures
it_it: Semplici Gesture

source: Simple Horizontal Gradient
it_it: Semplice Gradiente Orizzontale

source: Simple Image button
it_it: Pulsante immagine semplice

source: Simple Initialization
it_it: Inizializzazione Semplice

source: Simple Interface
it_it: Interfaccia Semplice

source: Simple Layer
it_it: Layer Semplice

source: Simple Line
it_it: Linea semplice

source: Simple List
it_it: Lista semplice

source: Simple Menu
it_it: Menù semplice

source: Simple Menu with custom header
it_it: Menù semplice con intestazione personalizzata

source: Simple Menu with floating btn to add new menu page
it_it: Menù semplice con pulsante mobile per aggiungere una nuova Menu Page

source: Simple Menu with root btn
it_it: Menù semplice con pulsante principale

source: Simple Message box
it_it: Message box semplice

source: Simple Roller
it_it: Roller semplice

source: Simple Slider
it_it: Slider semplice

source: Simple Spinbox
it_it: Spinbox semplice

source: Simple Subscription
it_it: Iscrizione Semplice

source: Simple Switch
it_it: Switch semplice

source: Simple Tabview
it_it: Tabview Semplice

source: Simple Text area
it_it: Area di testo semplice

source: Simple ``\0``-terminated string.
it_it: Semplice stringa terminata da ``\0``.

source: Simple binding
it_it: Binding Semplice

source: Simple gestures are always enabled and very easy to use:
it_it: Le gesture semplici sono sempre abilitate e molto facili da usare:

source: Simple navigation on a list widget
it_it: Grid navigation semplice su una lista di widget

source: Simple pixel units.
it_it: Semplici unità di pixel.

source: Simple snapshot example
it_it: Esempio semplice di snapshot

source: Simple spinner
it_it: Spinner semplice

source: Simple table
it_it: Tabella semplice

source: Simple translation example
it_it: Semplice esempio di traduzione

source: Simple types
it_it: Tipi semplici

source: Simple window
it_it: Window semplice

source: Simple: simple and natural syntax, support garbage collection, and easy to use FFI (foreign function interface).
it_it: Semplice: sintassi semplice e naturale, supporto per la garbage collection e interfaccia FFI (foreign function interface) facile da usare.

source: Simply call function :cpp:expr:`lv_snapshot_take(widget, color_format)` to generate the image descriptor which can be used as an Image Widget's image source using :cpp:func:`lv_image_set_src`.
it_it: È sufficiente chiamare la funzione :cpp:expr:`lv_snapshot_take(widget, color_format)` per generare il descrittore dell'immagine utilizzabile come sorgente dell'immagine di un Widget Image tramite :cpp:func:`lv_image_set_src`.

source: Simply load this project into your IDE and select your desired preset and you are good to go.
it_it: Basta caricare questo progetto nel proprio IDE e selezionare il preset desiderato.

source: Simply set ``LV_USE_DRAW_SW_ASM`` to ``LV_DRAW_SW_ASM_NEON`` in ``lv_conf``.
it_it: È sufficiente impostare ``LV_USE_DRAW_SW_ASM`` a ``LV_DRAW_SW_ASM_NEON`` in ``lv_conf``.

source: Simply setting them in the XML instance
it_it: Semplicemente impostandoli nell'istanza XML

source: Simply subscribe to a Subject and get notified when the Subject's value changes.
it_it: È sufficiente iscriversi a un Subject e ricevere una notifica quando il valore del Subject cambia.

source: Simultaneously, it allows you to interact with that UI to see how it will look and feel at runtime.
it_it: Allo stesso tempo, consente di interagire con l'interfaccia utente per vedere come apparirà e come funzionerà in fase di esecuzione.

source: Since :cpp:enumerator:`LV_PART_MAIN` and :cpp:enumerator:`LV_STATE_DEFAULT` both have zero values, you can simply pass ``0`` as the ``selector`` argument instead of ``LV_PART_MAIN | LV_STATE_DEFAULT`` as a shortcut when adding styles to an object.
it_it: Poiché :cpp:enumerator:`LV_PART_MAIN` e :cpp:enumerator:`LV_STATE_DEFAULT` hanno entrambi valore zero, si può semplicemente passare ``0`` come argomento ``selector`` invece di ``LV_PART_MAIN | LV_STATE_DEFAULT`` come scorciatoia quando si aggiungono stili a un oggetto.

source: Since AC6 is a proprietary toolchain, it contains many specific optimizations, so you can expect the best performance when using it.
it_it: Poiché AC6 è una toolchain proprietaria, contiene molte ottimizzazioni specifiche, quindi è possibile aspettarsi le migliori prestazioni quando la si utilizza.

source: Since DMA2D is implemented in LVGL as a draw unit, it can work in parallel with other draw units (typically only the software draw unit).
it_it: Poiché DMA2D è implementato in LVGL come unità di disegno, può funzionare in parallelo con altre unità di disegno (in genere solo l'unità di disegno software).

source: Since a :ref:`Keypad <indev_keypad>` has plenty of keys, it's easy to navigate between widgets and edit them using the keypad.
it_it: Poiché un :ref:`Keypad <indev_keypad>` ha molti tasti, è facile navigare tra i widget e modificarli utilizzando tale dispositivo.

source: Since a layer behaves similarly to an image, it can be rendered the same way as images:
it_it: Poiché un layer si comporta in modo simile a un'immagine, può essere renderizzato allo stesso modo delle immagini:

source: Since both functions start searching from a specific parent, it's possible to have multiple Widget subtrees with identical names under different parents.
it_it: Poiché entrambe le funzioni iniziano la ricerca da un elemento padre specifico, è possibile avere più sottoalberi di Widget con nomi identici sotto elementi padre diversi.

source: Since each instance has its own timeline, you can have multiple Components (e.g. 10 ``<list_item>``\ s) and play their ``load`` timelines independently with different delays.
it_it: Poiché ogni istanza ha la propria timeline, è possibile avere più Componenti (ad esempio 10 ``<list_item>``) e riprodurre le rispettive timeline ``load`` in modo indipendente con ritardi diversi.

source: Since each property is passed as an argument to the create function, each must have a value.
it_it: Poiché ogni proprietà viene passata come argomento alla funzione "create", ciascuna deve avere un valore.

source: Since it might take significant time to decode PNG images LVGL's :ref:`image caching` feature can be useful.
it_it: Poiché la decodifica delle immagini PNG potrebbe richiedere molto tempo, la funzione di memorizzazione nella :ref:`image caching` di LVGL può essere utile.

source: Since layer drawing and image drawing are handled the same way, this works for layers as well.
it_it: Poiché il disegno dei layer e quello delle immagini vengono gestiti allo stesso modo, questo funziona anche per i layer.

source: Since the LVGL Editor exports files in multiple nested directories, files like ``main_gen.c`` or ``widget_button.c`` need relative paths to find the main header file.
it_it: Poiché l'editor LVGL esporta file in più directory nidificate, file come ``main_gen.c`` o ``widget_button.c`` necessitano di path relativi per trovare il file header principale.

source: Since this is not a magical auto-importer, the developer retains full control over how files, styles, components, etc., are organized.
it_it: Poiché non si tratta di un importatore automatico magico, lo sviluppatore mantiene il pieno controllo su come vengono organizzati file, stili, componenti, ecc.

source: Since this path is different from the default value of S, you must set it specifically so the source can be located:
it_it: Poiché questo path è diverso dal valore predefinito di S, è necessario impostarlo specificamente in modo che il sorgente possa essere individuato:

source: Single Board Computer Displays
it_it: Display per Computer Single Board

source: Single Values
it_it: Valori Singoli

source: Single driver supporting all platforms with a consistent feature set.
it_it: Un singolo driver che supporta tutte le piattaforme con un set di funzionalità coerente.

source: Single frame buffer operation even with advanced graphic effects
it_it: Funzionamento con "framebuffer" singolo anche con effetti grafici avanzati

source: Single-Board Computer Displays
it_it: Display per Single-Board Computer

source: Single-buffered direct is shown in this example.
it_it: In questo esempio è mostrata la modalità diretta a buffer singolo.

source: Single-buffered mode is what you should use if memory is very scarce.
it_it: La modalità a buffer singolo è quella da utilizzare se la memoria è molto scarsa.

source: Single-buffered partial render mode supported for now.
it_it: Al momento è supportata la modalità di rendering parziale a buffer singolo.

source: Single-skeleton skinned character animations
it_it: Animazioni di personaggi con a "Single-skeleton skinned" [scheletro singolo rivestito]

source: Size
it_it: Dimensione

source: Size and position
it_it: Dimensioni e posizione

source: Size styles
it_it: Stili per le Dimensioni

source: Skew
it_it: Inclinato

source: Skew Widget horizontally.
it_it: Inclina il Widget orizzontalmente.

source: Skew Widget vertically.
it_it: Inclina il Widget verticalmente.

source: Skim the documentation of :ref:`widgets` to see what is available.
it_it: Consultare la documentazione di :ref:`widgets` per vedere cosa è disponibile.

source: Skipping hooks
it_it: Saltare gli hook

source: Sleep Management
it_it: Gestione della Modalità Sleep

source: Slide horizontally
it_it: Scorrere orizzontalmente

source: Slider with custom style
it_it: Slider con stile personalizzato

source: Slider with extended drawer
it_it: Slider estensibile

source: Slider with opposite direction
it_it: Slider con direzione opposta

source: Slots
it_it: Slot

source: Slots are available only for components.
it_it: Gli slot sono disponibili solo per i componenti.

source: Slots are very useful to create components like screen templates where the user is allowed to create children on certain internal UI elements.
it_it: Gli slot sono molto utili per creare componenti come i template di screen, in cui l'utente può creare elementi figlio su determinati elementi interni dell'interfaccia utente.

source: Small areas are not further divided into smaller tiles because the overhead of spinning up 4 cores would outweigh the benefits.
it_it: Le aree di piccole dimensioni non vengono ulteriormente suddivise in "tile" più piccoli perché il sovraccarico di 4 core supererebbe i vantaggi.

source: Small displays with low resolution don't look pretty with automatically rendered fonts.
it_it: I display piccoli a bassa risoluzione non sono gradevoli da vedere con i font renderizzati automaticamente.

source: Small monochrome displays
it_it: Piccoli display monocromatici

source: Smaller file sizes compared to JPEG and PNG
it_it: Dimensioni file ridotte rispetto a JPEG e PNG

source: Smaller score means that G2D is capable of drawing it faster.
it_it: Uno score più piccolo indica che G2D è in grado di disegnarlo più velocemente.

source: Smaller score means that PXP is capable of drawing it faster.
it_it: Uno score più piccolo indica che PXP è in grado di disegnarlo più velocemente.

source: Smaller score means that VGLite is capable of drawing it faster.
it_it: Uno score più piccolo indica che VGLite è in grado di disegnarlo più velocemente.

source: Snap alignment is set with :cpp:expr:`lv_obj_set_scroll_snap_x(widget, LV_SCROLL_SNAP_...)` and :cpp:expr:`lv_obj_set_scroll_snap_y(widget, LV_SCROLL_SNAP_...)`.
it_it: L'allineamento snap viene impostato con :cpp:expr:`lv_obj_set_scroll_snap_x(widget, LV_SCROLL_SNAP_...)` e :cpp:expr:`lv_obj_set_scroll_snap_y(widget, LV_SCROLL_SNAP_...)`.

source: Snapping
it_it: Aggancio

source: Snapshot provides an API to take a snapshot image for an LVGL Widget together with its children.
it_it: Snapshot fornisce un'API per acquisire un'immagine snapshot [istantanea] per un Widget LVGL insieme ai suoi elementi figlio.

source: So :cpp:expr:`lv_anim_delete(var, func)` only needs to be called if the object being deleted is *not* one of the Widgets.
it_it: Quindi :cpp:expr:`lv_anim_delete(var, func)` deve essere chiamato solo se l'oggetto eliminato *non* è uno dei Widget.

source: So at the end of the task, in the ``lvgl_yocto_guide/build/tmp/work/ cortexa53-poky-linux/lvgl/9.1.0``, you will find a ``build`` folder that was generated running the CMake command, but nothing is built yet.
it_it: Quindi, alla fine del task, in ``lvgl_yocto_guide/build/tmp/work/ cortexa53-poky-linux/lvgl/9.1.0``, troverete una cartella ``build`` che è stata generata eseguendo il comando CMake, ma non è ancora stato compilato nulla.

source: So for example, before building ``matchbox-desktop``, BitBake would build a cross compiler and ``glibc`` if they had not already been built.
it_it: Quindi, ad esempio, prima di compilare ``matchbox-desktop``, BitBake compilerebbe un cross-compilatore e ``glibc`` se non fossero già stati compilati.

source: So for lack of a better option, the Widget remains white from the default state's property.
it_it: Pertanto, in mancanza di un'opzione migliore, il Widget rimane bianco per la proprietà dello stato di default.

source: So for now, the sources are unmodified and the same than the commit that was specified.
it_it: Quindi, per ora, i sorgenti non sono modificati e sono uguali al commit specificato.

source: So if a button is pressed, and the text color comes from a parent, the pressed text color will be used.
it_it: Quindi, un pulsante è "pressed" [premuto] e il colore del testo proviene da un genitore, verrà utilizzato il colore del testo "pressed".

source: So if you use:
it_it: Quindi, se si utilizza:

source: So in the example the first row will have 2 buttons each with 50% width and a second row with 1 button having 100% width.
it_it: Quindi, nell'esempio, la prima riga avrà 2 pulsanti, ciascuno con larghezza pari al 50%, e una seconda riga con 1 pulsante con larghezza pari al 100%.

source: So in the gray/red button example above, the normal button style should be added first and the red style second.
it_it: Quindi, nell'esempio del pulsante grigio/rosso sopra, lo stile del pulsante normale dovrebbe essere aggiunto per primo e quello rosso per secondo.

source: So it should not be a local buffer (created on the stack) where its contents will be destroyed before that happens.
it_it: Quindi non dovrebbe trattarsi di un buffer locale (creato nello stack) il cui contenuto verrà distrutto prima che ciò accada.

source: So let's copy this base and keep it out of Buildroot.
it_it: Quindi copiamo questa base e teniamola fuori da Buildroot.

source: So let's examine the following case:
it_it: Esaminiamo il seguente caso:

source: So let's find which contribution option fits you the best and helps you join the development of LVGL!
it_it: Quindi, scopriamo quale opzione di contributo è più adatta ed è d'aiuto a partecipare allo sviluppo di LVGL!

source: So the physical resolution and the offset of the active area can be set with :cpp:expr:`lv_display_set_physical_resolution(disp, hor_res, ver_res)` and :cpp:expr:`lv_display_set_offset(disp, x, y)`
it_it: Quindi la risoluzione fisica e l'offset dell'area attiva possono essere impostati con :cpp:expr:`lv_display_set_physical_resolution(disp, hor_res, ver_res)` e :cpp:expr:`lv_display_set_offset(disp, x, y)`

source: So the total height of the content is 500 px.
it_it: Quindi l'altezza totale del contenuto è di 500 px.

source: So what does it look like?
it_it: Che aspetto ha?

source: So while you can probably start to render a 50x50 animation without SPIRAM, PSRAM is highly recommended.
it_it: Quindi, anche se probabilmente è possibile iniziare a renderizzare un'animazione 50x50 senza SPIRAM, una PSRAM è altamente consigliata.

source: So you don't need to invalidate the cache by calling :cpp:func:`lv_image_cache_drop` before destroying the draw buffer.
it_it: Quindi non è necessario invalidare la cache chiamando :cpp:func:`lv_image_cache_drop` prima di distruggere il buffer di disegno.
